Repository: UKGovernmentBEIS/help-to-heat-GBIS
Catalog: help_to_heat/locale/*/LC_MESSAGES/django.po
Languages: cy

source: The Department for Energy Security and Net Zero and related energy suppliers are the independent data controllers for your data. This privacy notice does not cover energy suppliers and how they use your data. You should also read your chosen energy supplier’s privacy notice to understand how they use your data. They are also required to manage your personal data in a way that meets the UK GDPR and DPA.
cy: Yr Adran Diogelwch Ynni a Sero Net a'r cyflenwyr ynni perthynol yw'r rheolwyr data annibynnol ar gyfer eich data. Nid yw'r hysbysiad preifatrwydd hwn yn cynnwys cyflenwyr ynni a sut maen nhw'n defnyddio'ch data. Dylech hefyd ddarllen hysbysiad preifatrwydd eich cyflenwr ynni dewisol chi er mwyn deall sut maen nhw'n defnyddio'ch data. Mae hefyd yn ofynnol iddyn nhw reoli'ch data personol mewn ffordd sy'n bodloni GDPR y Deyrnas Unedig a Deddf 2018.

source: Your data
cy: Eich data chi

source: We will process the following personal data:
cy: Byddwn yn prosesu'r data personol a ganlyn:

source: Your first name and last name
cy: Eich enw cyntaf a'ch enw olaf

source: The property’s council tax band
cy: Band treth gyngor yr eiddo

source: The property’s address
cy: Cyfeiriad yr eiddo

source: The property’s post code
cy: Cod post yr eiddo

source: The property’s EPC rating
cy: Cyfraddiad EPC yr eiddo

source: Questions or feedback you leave, including your email address if you contact us
cy: Cwestiynau neu adborth y byddwch chi'n eu gadael, gan gynnwys eich cyfeiriad ebost os byddwch yn cysylltu â ni

source: If anyone in your household is receiving benefits
cy: A oes unrhyw un yn eich aelwyd yn cael budd-daliadau

source: If your annual household is above or below £31,000
cy: A yw incwm blynyddol eich aelwyd yn uwch neu'n is na £31,000

source: Information about your property
cy: Gwybodaeth am eich eiddo

source: Building characteristics
cy: Nodweddion yr adeilad

source: Information about measures installed in your property
cy: Gwybodaeth am fesurau sydd wedi'u gosod yn eich eiddo

source: Your email address and phone number when you have provided these
cy: Eich cyfeiriad ebost a'ch rhif ffôn pan fyddwch chi wedi darparu'r rhain

source: This data is collected as you proceed through the application process and when you submit your application.
cy: Mae'r data yma'n cael ei gasglu wrth ichi symud drwy'r broses ymgeisio ac wrth ichi gyflwyno'ch cais.

source: To enable the Check Eligibility for GB Insulation service to allow you to check if you might be eligible for help with energy efficiency measures.
cy: Galluogi gwasanaeth Gwirio’ch Cymhwystra ar gyfer Cynllun Inswleiddio Mawr Prydain i ganiatáu ichi a allech fod yn gymwys i gael cymorth gyda mesurau effeithlonrwydd ynni.

source: We also collect your personal data to help energy suppliers and their installers (only when you refer):
cy: Rydyn ni hefyd yn casglu'ch data personol i helpu cyflenwyr ynni a’u gosodwyr i wneud y canlynol (dim ond pan fyddwch yn atgyfeirio):

source: Verify your identity
cy: Dilysu pwy ydych chi

source: Confirm what type of energy-saving support your property may be eligible for
cy: Cadarnhau pa fath o gymorth arbed ynni y gallai'ch eiddo fod yn gymwys i'w gael

source: We also collect your personal data to help improve our services so we can:
cy: Rydyn ni hefyd yn casglu'ch data personol i helpu i wella'n gwasanaethau er mwyn inni:

source: Send email confirmation of your referral (if you provide an email address)
cy: Anfon cadarnhad ebost o'ch atgyfeiriad (os byddwch yn darparu cyfeiriad ebost)

source: Analyse uptake of the service
cy: Dadansoddi'r niferoedd sy'n manteisio ar y gwasanaeth

source: Provide support via our call centre if you encounter any issues or need advice and guidance
cy: Rhoi cymorth trwy'n canolfan alwadau os byddwch yn dod ar draws unrhyw broblemau neu angen cyngor ac arweiniad

source: Monitor the success of referrals made by this service
cy: Monitro llwyddiant yr atgyfeiriadau sy'n cael eu gwneud gan y gwasanaeth yma

source: Evaluate and improve the service based on any feedback provided
cy: Gwerthuso a gwella'r gwasanaeth ar sail unrhyw adborth a ddarperir

source: Monitor use of the site to identify security threats
cy: Monitro'r defnydd ar y wefan er mwyn adnabod bygythiadau i ddiogelwch

source: Legal basis of processing
cy: Sail gyfreithlon y prosesu

source: The legal basis for processing your personal data is processing is necessary for the performance of a task carried out in the public interest. In this case, to support the installation of energy-saving measures to properties at reduced cost to households.
cy: Y sail gyfreithlon dros brosesu'ch data personol yw bod y prosesu'n angenrheidiol er mwyn cyflawni tasg sy'n cael ei chyflawni er budd y cyhoedd sef, yn yr achos hwn, helpu i osod mesurau arbed ynni mewn eiddo am gost is i'r aelwydydd.

source: Recipients
cy: Derbynwyr

source: We will share the following data with your chosen energy supplier and their installers:
cy: Byddwn yn rhannu'r data a ganlyn gyda'ch dewis gyflenwr ynni a'u gosodwyr:

source: The property's postcode and address
cy: Cod post a chyfeiriad yr eiddo

source: The property's council tax band
cy: Band treth gyngor yr eiddo

source: The property's EPC rating
cy: Cyfraddiad EPC yr eiddo

source: If your annual household income is above or below £31,000
cy: A yw incwm blynyddol eich aelwyd yn uwch neu'n is na £31,000

source: The number of bedrooms in your property
cy: Nifer yr ystafelloedd gwely yn eich eiddo

source: Your property's wall insulation
cy: Inswleiddiad waliau'ch eiddo

source: Your property's loft insulation
cy: Inswleiddiad atig eich eiddo

source: The purpose of this is to:
cy: Diben gwneud hyn yw:

source: Make a referral to energy suppliers, if your property might be eligible for energy-saving measures
cy: Gwneud atgyfeiriad at gyflenwyr ynni, os gallai'ch eiddo fod yn gymwys i gael mesurau arbed ynni

source: Help energy suppliers confirm your information
cy: Helpu cyflenwyr ynni i gadarnhau'ch gwybodaeth

source: Help energy suppliers contact you to arrange a visit to the property, based on your eligibility for the Great British insulation Scheme
cy: Helpu cyflenwyr ynni i gysylltu â chi i drefnu ymweliad â'r eiddo, ar sail eich cymhwystra ar gyfer Cynllun Inswleiddio Mawr Prydain

source: We have a data sharing agreement with energy suppliers so that we can share your personal data with them to deliver this service. Your energy supplier will also share your personal data with their installers during the processing of your application. The sharing of the data between energy suppliers, energy suppliers' installers and the Department for Energy Security and Net Zero is for the purpose of administration, delivery, reporting, monitoring, evaluation and fraud prevention necessary within the Great British Insulation scheme.
cy: Mae gennyn ni gytundeb rhannu data gyda chyflenwyr ynni fel y gallwn rannu'ch data personol chi gyda nhw i ddarparu'r gwasanaeth yma. Bydd eich cyflenwr ynni hefyd yn rhannu'ch data personol gyda'u gosodwyr nhw wrth brosesu'ch cais. Mae'r data'n cael ei rannu rhwng cyflenwyr ynni, gosodwyr cyflenwyr ynni a'r Adran Diogelwch Ynni a Sero Net at ddibenion gweinyddu, cyflwyno, adrodd, monitro, gwerthuso ac atal twyll sy'n angenrheidiol o fewn Cynllun Inswleiddio Mawr Prydain.

source: When you use the call centre assisted service the service will be provided by ResQ may also exchange information provided on calls and other correspondence with the Department for Energy Security and Net Zero when there is a need to process your application, if you cannot use the digital service. Calls to the call centre will be recorded and retained for up to two years.
cy: Pan fyddwch chi'n defnyddio'r gwasanaeth â chymorth y ganolfan alwadau, caiff y gwasanaeth ei ddarparu gan ResQ a allai hefyd gyfnewid gwybodaeth a ddarperir ar alwadau a gohebiaeth arall gyda'r Adran Diogelwch Ynni a Sero Net pan fydd angen prosesu'ch cais, os na allwch chi ddefnyddio'r gwasanaeth digidol. Bydd galwadau i'r ganolfan alwadau yn cael eu recordio a'u cadw am hyd at ddwy flynedd.

source: We may share your name and address with a contracted provider to contact you in writing to conduct research and evaluation about the service so we can deliver the scheme effectively and analyse the impact of the scheme. Any research is voluntary and will not affect the outcome of your application. You would have the right to withdraw at any time using the contact details provided by the contracted provider at the time of the research request.
cy: Gallwn rannu'ch enw a'ch cyfeiriad gyda darparwr dan gontract i gysylltu â chi mewn ysgrifen i wneud gwaith ymchwilio a gwerthuso ynglŷn a'r gwasanaeth er mwyn inni gyflawni'r cynllun yn effeithiol a dadansoddi effaith y cynllun. Mae unrhyw ymchwil yn wirfoddol ac ni fydd yn effeithio ar ganlyniad eich cais. Byddai gennych chi hawl i dynnu'n ôl unrhyw bryd drwy ddefnyddio'r manylion cysylltu a ddarparwyd gan y darparwr dan gontract adeg y cais ymchwil.

source: We will share your data with other government bodies or energy suppliers if we are required to do so by law - for example, by court order, or to prevent fraud or other crime.
cy: Byddwn yn rhannu'ch data gyda chyrff eraill y llywodraeth neu gyflenwyr ynni os yw'n ofynnol inni wneud hynny yn ôl y gyfraith, er enghraifft, drwy orchymyn llys, neu i atal twyll neu droseddau eraill.

source: Retention
cy: Cadw gwybodaeth

source: We will only keep your personal data for as long as required to support the delivery, evaluation and scrutiny of the service.
cy: Dim ond cyhyd ag sy'n ofynnol i gefnogi'r gwaith o gyflwyno, gwerthuso a chraffu ar y gwasanaeth y byddwn yn cadw'ch data personol.

source: Personal data will be retained for up to two years after the GB Insulation Scheme has ended. Following this, the data will be securely deleted after collection in line with the Department for Energy Security and Net Zero policy.
cy: Bydd data personol yn cael ei gadw am hyd at ddwy flynedd ar ôl i Gynllun Inswleiddio Mawr Prydain ddod i ben. Yn dilyn hyn, bydd y data'n cael ei ddileu'n ddiogel ar ôl ei gasglu yn unol â pholisi'r Adran Diogelwch Ynni a Sero Net.

source: During this time it will be accessible by the Department for Energy Security and Net Zero and your energy supplier.
cy: Yn ystod y cyfnod hwn bydd modd iddo gael ei weld gan yr Adran Diogelwch Ynni a Sero Net a'ch cyflenwr ynni.

source: Your rights
cy: Eich hawliau

source: You have the right to request information about how your personal data are processed, and to request a copy of that personal data.
cy: Mae gennych chi hawl i ofyn am wybodaeth am sut mae'ch data personol yn cael ei brosesu, ac i ofyn am gopi o'r data personol hwnnw.

source: You have the right to request that any inaccuracies in your personal data are rectified without delay. You have the right to request that any incomplete personal data are completed, including by means of a supplementary statement.
cy: Mae gennych chi hawl i ofyn i unrhyw anghywirdebau yn eich data personol gael eu cywiro'n ddi-oed. Mae gennych chi hawl i ofyn i unrhyw ddata personol anghyflawn gael ei gwblhau, gan gynnwys trwy ddatganiad atodol.

source: You have the right to request that your personal data are erased if there is no longer a justification for them to be processed.
cy: Mae gennych chi hawl i ofyn i'ch data personol gael ei ddileu os nad oes cyfiawnhad dros ei brosesu mwyach.

source: You have the right in certain circumstances (for example, where accuracy is contested) to request that the processing of your personal data is restricted.
cy: Mae gennych chi hawl dan rai amgylchiadau (er enghraifft, pan fyddwch chi'n dadlau nad yw'n gywir) i ofyn i'r gwaith prosesu ar eich data personol gael ei gyfyngu.

source: You have the right to object to the processing of your personal data where it is processed for direct marketing purposes.
cy: Mae gennych chi hawl i wrthwynebu prosesu'ch data personol pan fo'n cael ei brosesu at ddibenion marchnata uniongyrchol.

source: You have the right to object to the processing of your personal data including the right to object to automated processing.
cy: Mae gennych chi hawl i wrthwynebu prosesu'ch data personol gan gynnwys yr hawl i wrthwynebu prosesu awtomataidd.

source: International transfers
cy: Trosglwyddiadau rhyngwladol

source: We design, build and run our systems to make sure that your data is as safe as possible at all stages, both while it's processed and when it's stored.
cy: Rydyn ni'n dylunio, yn adeiladu ac yn rhedeg ein systemau i sicrhau bod eich data mor ddiogel â phosibl ym mhob cyfnod, a hynny tra bo'n cael ei brosesu a phan gaiff ei storio.

source: As your personal data is stored on our IT infrastructure and shared with our data processors Microsoft, GOV.UK Notify and Amazon Web Services, it may be transferred and stored securely in the UK and European Economic Area. Where it is the case that your personal data is stored outside the UK and EEA it will be subject to equivalent legal protection through the use of Model Contract Clauses.
cy: Gan fod eich data personol yn cael ei storio ar ein seilwaith TG a'i rannu gyda'n proseswyr data, sef Microsoft, GOV.UK Notify ac Amazon Web Services, caniateir iddo gael ei drosglwyddo a'i storio'n ddiogel yn y Deyrnas Unedig a'r Ardal Economaidd Ewropeaidd (AEE). Os yw eich data personol yn cael ei storio y tu allan i'r Deyrnas Unedig a'r AEE, bydd yn dod o dan amddiffyniad cyfreithiol cyfatebol trwy ddefnyddio Cymalau Contract Enghreifftiol.

source: Complaints
cy: Cwyno

source: If you consider that your personal data has been misused or mishandled, you may make a complaint to the Information Commissioner, who is an independent regulator.
cy: Os ydych chi o'r farn bod eich data personol wedi cael ei gamddefnyddio neu ei gam-drin, gallwch wneud cwyn i'r Comisiynydd Gwybodaeth, sy'n rheoleiddiwr annibynnol.

source: The Information Commissioner can be contacted at:
cy: Gallwch gysylltu â'r Comisiynydd Gwybodaeth yma:

source: Information Commissioner's Office
cy: Swyddfa'r Comisiynydd Gwybodaeth

source: Website:
cy: Gwefan:

source: Any complaint to the Information Commissioner is without prejudice to your right to seek redress through the courts.
cy: Mae unrhyw gŵyn i'r Comisiynydd Gwybodaeth yn cael ei gwneud heb ragfarn i'ch hawl i geisio iawn drwy'r llysoedd.

source: The data controller for your personal data is the Department for Energy Security and Net Zero
cy: Y rheolwr data ar gyfer eich data personol yw'r Adran Diogelwch Ynni a Sero Net

source: You can contact the Data Protection Officer at:
cy: Gallwch gysylltu â'r Swyddog Diogelu Data yma:

source: Email:
cy: Ebost:

source: Changes to this policy
cy: Newidiadau yn y polisi yma

source: We may change this privacy policy. In that case, the 'last updated' date at the bottom of this page will also change. Any changes to this privacy policy will apply to you and your data immediately.
cy: Gallwn newid y polisi preifatrwydd yma. Os felly, bydd dyddiad y 'diweddariad diwethaf' ar waelod y tudalen hwn hefyd yn newid. Bydd unrhyw newidiadau yn y polisi preifatrwydd yma yn gymwys i chi a'ch data ar unwaith.

source: If these changes affect how your personal data is processed, we will take reasonable steps to let you know.
cy: Os bydd y newidiadau hyn yn effeithio ar sut mae'ch data personol yn cael ei brosesu, byddwn yn cymryd camau rhesymol i roi gwybod ichi.

source: Last updated 21 June 2023
cy: Y diweddariad diwethaf 21 Mehefin 2023

source: Change Log:
cy: Log Newidiadau:

source: What is the subtype of your property? - Check eligibility for Great British Insulation Scheme - GOV.UK
cy: Beth yw is-fath eich eiddo? - Gwirio’ch cymhwystra ar gyfer Cynllun Inswleiddio Mawr Prydain - GOV.UK

source: What kind of %(property_type)s do you have?
cy: Pa fath o %(property_type)s sydd gennych?

source: Why do we need to know this?
cy: Pam mae angen inni wybod hyn?

source: Energy use varies between different buildings, particularly for heating.
cy: Mae'r defnydd o ynni yn amrywio rhwng gwahanol adeiladau, yn enwedig ar gyfer gwres.

source: Some home improvements are only possible or appropriate for certain buildings.
cy: Mae rhai gwelliannau i'r aelwyd yn bosibl neu'n briodol mewn mathau penodol o adeiladau yn unig.

source: What type is your property? - Check eligibility for Great British Insulation Scheme - GOV.UK
cy: Pa fath o eiddo yw eich eiddo? - Gwirio’ch cymhwystra ar gyfer Cynllun Inswleiddio Mawr Prydain - GOV.UK

source: What kind of property do you have?
cy: Pa fath o eiddo sydd gennych?

source: Schemes you are eligible for - Check eligibility for Great British Insulation Scheme - GOV.UK
cy: Cynlluniau rydych chi'n gymwys ar eu cyfer - Gwirio’ch cymhwystra ar gyfer Cynllun Inswleiddio Mawr Prydain - GOV.UK

source: Continue to create a referral
cy: Parhau i greu atgyfeiriad

source: We think you might be eligible
cy: Rydyn ni’n credu y gallech chi fod yn gymwys

source: Based on your answers, the Great British Insulation Scheme might be suitable for you.
cy: Ar sail eich atebion, fe allai Cynllun Inswleiddio Mawr Prydain fod yn addas i chi.

source: Please read the following details carefully
cy: Darllenwch y manylion canlynol yn ofalus

source: The Great British Insulation Scheme is delivered by energy suppliers and their installation partners. They will assess your home, either by a desktop assessment or by arranging a visit to your home. They will determine if they can offer you insulation.
cy: Mae Cynllun Inswleiddio Mawr Prydain yn cael ei ddarparu gan gyflenwyr ynni a'u partneriaid gosod. Byddan nhw’n asesu’ch cartref, naill ai drwy asesiad wrth y bwrdd gwaith neu drwy drefnu ymweliad â'ch cartref. Nhw fydd yn penderfynu a allan nhw gynnig inswleiddiad i chi.

source: What you could be eligible for
cy: Beth allech chi fod yn gymwys i’w gael

source: Based on your answers, you may be able to get the following:
cy: Ar sail eich atebion, mae’n bosibl y byddwch chi’n gallu cael y canlynol:

source: Your contribution
cy: Eich cyfraniad chi

source: Park home insulation may not be available from %(supplier)s or their installation partner. If it is available, you would likely have to pay towards the cost of installing it. You might be asked to contribute between £1,000 - £10,000.
cy: Efallai na fydd inswleiddiad ar gyfer cartref mewn parc ar gael gan %(supplier)s neu eu partner gosod. Os oes inswleiddiad ar gael, mae'n debygol y byddai'n rhaid ichi dalu tuag at gost y gwaith gosod. Efallai y gofynnir ichi gyfrannu rhwng £1,000 a £10,000.

source: Based on your answers, you may be able to get one of the following:
cy: Ar sail eich atebion, mae’n bosibl y byddwch chi’n gallu cael un o'r canlynol:

source: The following measures are less likely to be viable, but depending on the assessment of your home, you may otherwise be able to get one of:
cy: Mae'r mesurau canlynol yn llai tebygol o fod yn ymarferol, ond gan ddibynnu ar yr asesiad o’ch cartref, mae’n bosibl y byddwch chi fel arall yn gallu cael un o'r canlynol:

source: solid or under floor insulation
cy: inswleiddiad llawr solet neu inswleiddiad dan y llawr

source: You may have to pay towards the cost of installation. Costs and the viability of an install going ahead depend on your home's location, property type and tenure, accessibility, ventilation requirements, and the installation company available.
cy: Efallai y bydd rhaid ichi dalu tuag at gost y gwaith gosod. Mae’r costau a’r tebygrwydd y bydd y gwaith gosod yn mynd yn ei flaen yn dibynnu ar leoliad eich cartref, y math o eiddo a’r ddeiliadaeth, hygyrchedd, gofynion awyru, a'r cwmni gosod sydd ar gael.

source: For an average 3-bedroom semi-detached house, typical contributions could be:
cy: Ar gyfer tŷ pâr cyffredin â 3 ystafell wely, gallai'r cyfraniadau nodweddiadol fod fel hyn:

source: Less than £1,000
cy: Llai na £1,000

source: under floor insulation
cy: inswleiddiad dan y llawr

source: More than £5,000
cy: Mwy na £5,000

source: solid wall insulation
cy: inswleiddiad llawr solet

source: The viability of an install going ahead depends on your home's location, property type and tenure, accessibility, ventilation requirements, and the installation company available.
cy: Mae’r tebygrwydd y bydd y gwaith gosod yn mynd yn ei flaen yn dibynnu ar leoliad eich cartref, y math o eiddo a’r ddeiliadaeth, hygyrchedd, gofynion awyru, a'r cwmni gosod sydd ar gael.

source: %(supplier)s can reject your referral if they assess your property as not viable for any insulation. They are not obligated to install insulation if you are eligible.
cy: Gall %(supplier)s wrthod eich atgyfeiriad os byddan nhw’n asesu’ch eiddo fel un nad yw'n ymarferol gosod unrhyw inswleiddiad ynddo. Does dim rheidrwydd arnyn nhw i osod inswleiddiad os ydych chi’n gymwys.

source: It could take several weeks to be informed of the outcome of your referral.
cy: Gallai gymryd sawl wythnos ichi gael gwybod am ganlyniad eich atgyfeiriad.

source: If insulation is installed, adequate ventilation must be ensured and added if existing ventilation is insufficient.
cy: Os bydd inswleiddiad yn cael ei osod, rhaid sicrhau trefniant awyru digonol a rhaid ychwanegu trefniant awyru digonol os nad yw'r awyru presennol yn ddigonol.

source: Find out more about ventilation
cy: Rhagor o wybodaeth am awyru

source: A well-ventilated property must have methods of extracting water vapour and pollutants, supplying a minimum level of outdoor air for occupant’s health, quickly diluting indoor air pollutants and water vapour, and minimising the entry of external air pollutants. To achieve this you may need:
cy: Rhaid i eiddo sydd wedi'i awyru'n dda fod â dulliau o dynnu anwedd dŵr a llygryddion, gan roi lefel ofynnol o aer o’r tu allan ar gyfer iechyd y preswylydd, gan wanhau llygryddion aer dan do ac anwedd dŵr yn gyflym a lleihau mynediad llygryddion aer allanol. Er mwyn cyflawni hyn, efallai y bydd arnoch chi angen:

source: Background ventilation (such as trickle vents in window frames)
cy: Trefniant awyru cefndir (fel fentiau diferynnu yn fframiau’r ffenestri)

source: Mechanical ventilation (such as extractor fans)
cy: Trefniant awyru mecanyddol (fel gwyntyll tynnu aer)

source: Crossflow ventilation (such as gaps or vents in doors)
cy: Trefniant awyru trawslif (fel bylchau neu fentiau mewn drysau)

source: If you are comfortable with this then in the next step you can create a referral to %(supplier)s. You can decide not to go ahead if you do not agree with their assessment or the contribution required.
cy: Os ydych chi'n gyffyrddus gyda hyn yna yn y cam nesaf gallwch greu atgyfeiriad at %(supplier)s. Gallwch benderfynu peidio â bwrw ymlaen os na fyddwch chi’n cytuno â'u hasesiad nhw neu â'r cyfraniad angenrheidiol

source: I understand my home must be sufficiently ventilated before any insulation is installed
cy: Dwi'n deall bod rhaid i’m cartref fod wedi’i awyru’n ddigonol cyn i unrhyw inswleiddiad gael ei osod

source: I understand that I may be required to pay towards installing insulation if it is offered
cy: Dwi'n deall y gall fod yn ofynnol imi gyfrannu at gost gosod inswleiddiad.

source: This is likely because your property's council tax band is too high. This service is for properties in an eligible council tax band (A to D in England and A to E in Scotland and Wales).
cy: Y rheswm tebygol am hyn yw bod band treth gyngor eich eiddo yn rhy uchel. Mae'r gwasanaeth hwn ar gyfer eiddo mewn band treth gyngor cymwys (A i D yn Lloegr ac A i E yng Nghymru a'r Alban).

source: Service unavailable - Check eligibility for Great British Insulation Scheme - GOV.UK
cy: Gwasanaeth heb fod ar gael - Gwirio’ch cymhwystra ar gyfer Cynllun Inswleiddio Mawr Prydain - GOV.UK
