Repository: UKGovernmentBEIS/help-to-heat-GBIS
Catalog: help_to_heat/locale/*/LC_MESSAGES/django.po
Languages: cy

source: I agree for my personal details to be shared with %(supplier)s to contact me about my referral. I agree that they may share my personal details with their approved delivery partners and installers to check my eligibility, my property's suitability, and to contact me.
cy: Dwi'n cytuno i'm manylion personol gael eu rhannu gyda %(supplier)s i gysylltu â mi ynghylch fy atgyfeiriad i. Dwi’n cytuno y cân nhw rannu fy manylion personol i gyda’u partneriaid cyflenwi a’u gosodwyr a gymeradwywyd i wirio fy nghymhwystra i ac addasrwydd fy eiddo i ac i gysylltu â mi.

source: Further information on our GDPR UK Privacy Policy
cy: Rhagor o wybodaeth am ein Polisi Preifatrwydd o dan GDPR y DU

source: I acknowledge that the information I have provided indicates I may be eligible for support. However, I understand that my referral will be subject to further checks before %(supplier)s can determine which, if any, insulation measures are appropriate.
cy: Dwi’n cydnabod bod yr wybodaeth dw i wedi'i darparu yn dangos y gallwn i fod yn gymwys i gael cymorth. Er hynny, dwi’n deall y bydd fy atgyfeiriad yn mynd drwy ragor o wiriadau cyn y gall %(supplier)s benderfynu pa fesurau inswleiddio sy'n briodol, os oes unrhyw fesurau inswleiddio’n briodol o gwbl.

source: What are your contact details? - Check eligibility for Great British Insulation Scheme - GOV.UK
cy: Beth yw'ch manylion cysylltu? - Gwirio’ch cymhwystra ar gyfer Cynllun Inswleiddio Mawr Prydain - GOV.UK

source: Add your personal and contact details
cy: Ychwanegwch eich manylion personol a'ch manylion cysylltu

source: The details entered below will be used by %(supplier)s and their subcontractors to review your referral and provide you with relevant updates. Emails will be used to provide you with updates and telephone calls to discuss measure details.
cy: Bydd y manylion a nodir isod yn cael eu defnyddio gan %(supplier)s a'u hisgontractwyr i adolygu'ch atgyfeiriad a rhoi diweddariadau perthnasol ichi. Bydd negeseuon ebost yn cael eu defnyddio i roi diweddariadau a galwadau ffôn ichi i drafod manylion y mesurau.

source: Personal details
cy: Manylion personol

source: Contact details
cy: Manylion cysylltu

source: We will need at least one of these for an energy supplier to be able to contact you.
cy: Bydd arnon ni angen o leiaf un o'r rhain er mwyn i gyflenwr ynni allu cysylltu â chi.

source: Email address
cy: Cyfeiriad ebost

source: Cookie information - Check eligibility for Great British Insulation Scheme - GOV.UK
cy: Gwybodaeth cwcis - Gwirio’ch cymhwystra ar gyfer Cynllun Inswleiddio Mawr Prydain - GOV.UK

source: You've set your cookie preferences.
cy: Rydych chi wedi gosod eich dewisiadau cwcis

source: Cookies
cy: Cwcis

source: puts small files (known as 'cookies') on your computer.
cy: yn gosod ffeiliau bach (o'r enw ‘cwcis') ar eich cyfrifiadur.

source: These cookies are used across the Check eligibility for Great British Insulation Scheme website.
cy: Mae'r cwcis yma yn cael eu defnyddio ar draws gwefan Gwirio'ch cymhwystra ar gyfer Cynllun Inswleiddio Mawr Prydain.

source: We only set cookies when JavaScript is running in your browser and you've accepted them. If you choose not to run Javascript, the information on this page will not apply to you.
cy: Dim ond pan fydd JavaScript yn rhedeg yn eich porwr a'ch bod chi wedi'u derbyn y byddwn ni'n gosod cwcis ar eich cyfrifiadur. Os ydych chi'n dewis peidio â rhedeg Javascript, fydd yr wybodaeth ar y tudalen yma ddim yn gymwys i chi.

source: Find out
cy: Darganfod

source: how to manage cookies
cy: sut i reoli cwcis

source: from the Information Commissioner's Office.
cy: gan Swyddfa'r Comisiynydd Gwybodaeth.

source: Essential cookies (strictly necessary)
cy: Cwcis hanfodol (cwbl angenrheidiol)

source: We use an essential cookie to remember when you accept or reject cookies on our website.
cy: Rydyn ni'n defnyddio cwci hanfodol er mwyn cofio pryd rydych chi'n derbyn neu'n gwrthod cwcis ar ein gwefan.

source: Essential cookies we use
cy: Cwcis hanfodol rydyn ni'n eu defnyddio

source: Name
cy: Enw

source: Purpose
cy: Diben

source: Expires
cy: Yn dod i ben

source: Saves your cookie consent settings
cy: Yn cadw'ch gosodiadau cydsyniad cwcis

source: 1 year
cy: 1 flwyddyn

source: Analytics cookies (strictly necessary) (optional)
cy: Cwcis dadansoddeg (cwbl angenrheidiol) (dewisol)

source: We use Google Analytics software to understand how people use the Check eligibility for Great British Insulation Scheme. We do this to help make sure the site is meeting the needs of its users and to help us make improvements.
cy: Rydyn ni'n defnyddio meddalwedd Google Analytics i ddeall sut mae pobl yn defnyddio Gwirio’ch Cymhwystra ar gyfer Cynllun Inswleiddio Mawr Prydain. Rydyn ni'n gwneud hyn i helpu i sicrhau bod y wefan yn ateb anghenion ei defnyddwyr ac i'n helpu i wneud gwelliannau.

source: We do not collect or store your personal information (for example your name or address) so this information cannot be used to identify who you are.
cy: Dydyn ni ddim yn casglu nac yn storio'ch gwybodaeth bersonol (er enghraifft eich enw neu'ch cyfeiriad) felly does dim modd i'r wybodaeth yma gael ei defnyddio i gael gwybod pwy ydych chi.

source: We do not allow Google to use or share our analytics data.
cy: Dydyn ni ddim yn caniatáu i Google ddefnyddio'n data dadansoddeg ni na'i rannu.

source: Google Analytics stores information about:
cy: Mae Google Analytics yn storio gwybodaeth am y canlynol:

source: the pages you visit
cy: y tudalennau rydych chi'n ymweld â nhw

source: how long you spend on each page
cy: faint o amser rydych chi'n ei dreulio ar bob tudalen

source: how you arrived at the site
cy: sut daethoch chi i'r wefan

source: what you click on while you visit the site
cy: ar beth rydych chi'n clicio tra byddwch yn ymweld â'r wefan

source: the device and browser you use
cy: y ddyfais a'r porwr rydych chi'n eu defnyddio

source: Analytics cookies we use
cy: Cwcis dadansoddeg rydyn ni'n eu defnyddio

source: Helps us count how many people visit the Check eligibility for Great British Insulation Scheme by telling us if you've visited before.
cy: Yn ein helpu i gyfrif faint sy'n ymweld â Gwirio’ch Cymhwystra ar gyfer Cynllun Inswleiddio Mawr Prydain drwy ddweud wrthon ni a ydych chi wedi bod yma o'r blaen.

source: _gat_UA-[random number]
cy: _gat_UA-[rhif ar hap]

source: Used to reduce the number of requests.
cy: Yn cael ei ddefnyddio i leihau nifer y ceisiadau.

source: Save cookie settings
cy: Cadw gosodiadau cwcis

source: What is the property's council tax band? - Check eligibility for Great British Insulation Scheme - GOV.UK
cy: Beth yw band Treth Gyngor yr eiddo? - Gwirio’ch cymhwystra ar gyfer Cynllun Inswleiddio Mawr Prydain - GOV.UK

source: What is the council tax band of your property?
cy: Beth yw band treth gyngor eich eiddo?

source: Select your council tax band from the list below
cy: Dewiswch eich band treth gyngor o'r rhestr isod

source: If you're unsure, you can check your property's council tax band.
cy: Os nad ydych yn siŵr, gallwch wirio band treth gyngor eich eiddo.

source: Where is the property located? - Check eligibility for Great British Insulation Scheme - GOV.UK
cy: Ble mae'r eiddo wedi'i leoli? - Gwirio’ch cymhwystra ar gyfer Cynllun Inswleiddio Mawr Prydain - GOV.UK

source: Where is the property located?
cy: Beth yw lleoliad yr eiddo?

source: You are ineligible for support - Check eligibility for Great British Insulation Scheme - GOV.UK
cy: Dydych chi ddim yn gymwys i gael cymorth - Gwirio'ch cymhwystra ar gyfer Cynllun Inswleiddio Mawr Prydain - GOV.UK

source: It's likely that your home already has suitable energy saving measures
cy: Mae'n debygol bod gan eich aelwyd fesurau arbed ynni addas yn barod

source: This service is for homes with lower energy performance ratings, from D to G.
cy: Mae'r gwasanaeth hwn ar gyfer aelwydydd sydd â chyfraddiad perfformiad ynni is, o D i G.

source: What is the EPC of this property? - Check eligibility for Great British Insulation Scheme - GOV.UK
cy: Beth yw EPC yr eiddo hwn? - Gwirio’ch cymhwystra ar gyfer Cynllun Inswleiddio Mawr Prydain - GOV.UK

source: Find your EPC
cy: Chwilio am eich EPC

source: We found an Energy Performance Certificate that might be yours
cy: Fe gawson ni afael ar Dystysgrif Perfformiad Ynni a allai fod yn perthyn i chi

source: This certificate may be registered to your property or one of the properties nearby that shares part of your address.
cy: Fe allai'r dystysgrif yma fod wedi'i chofrestru ar gyfer eich eiddo chi neu un o'r eiddo cyfagos sy'n rhannu rhan o'ch cyfeiriad.

source: Certificate
cy: Tystysgrif

source: Registered address
cy: Cyfeiriad cofrestredig

source: EPC rating
cy: Cyfraddiad EPC

source: Is this your EPC?
cy: Ai eich EPC chi yw hon?

source: Thanks for the feedback - Check eligibility for Great British Insulation Scheme - GOV.UK
cy: Diolch am yr adborth - Gwirio’ch cymhwystra ar gyfer Cynllun Inswleiddio Mawr Prydain - GOV.UK

source: Thank you for your feedback
cy: Diolch ichi am eich adborth

source: Return to your application
cy: Dychwelyd i'ch cais

source: Give us some feedback - Check eligibility for Great British Insulation Scheme - GOV.UK
cy: Rhowch adborth inni - Gwirio’ch cymhwystra ar gyfer Cynllun Inswleiddio Mawr Prydain - GOV.UK

source: Help us improve the service
cy: Helpwch ni i wella'r gwasanaeth

source: There is a problem
cy: Mae yna broblem

source: Please answer at least one question before submitting feedback
cy: Atebwch o leiaf un cwestiwn cyn cyflwyno adborth

source: Overall, how satisfied are you with this online service?
cy: Yn gyffredinol, pa mor fodlon rydych chi â'r gwasanaeth ar-lein yma?

source: Why did you use this service today?
cy: Pam defnyddioch chi'r gwasanaeth yma heddiw?

source: I had sufficient detail or guidance on every page to proceed to the next step.
cy: Fe ges i ddigon o fanylion neu arweiniad ar bob tudalen i symud ymlaen i'r cam nesaf.

source: To what extent do you agree with the above statement?
cy: I ba raddau rydych chi'n cytuno â'r gosodiad uchod?

source: I was able to answer all questions accurately, to the best of my knowledge.
cy: Roeddwn i'n gallu ateb pob cwestiwn yn gywir, hyd eithaf fy ngwybodaeth.

source: I received the advice I was looking for.
cy: Fe ges i’r cyngor roeddwn i’n chwilio amdano.

source: How could we improve the service?
cy: Sut gallen ni wella'r gwasanaeth?

source: Do not include any personal or financial information, for example your National Insurance or credit card numbers.
cy: Peidiwch â chynnwys unrhyw faterion personol na gwybodaeth ariannol, er enghraifft eich rhif Yswiriant Gwladol neu rifau cardiau credyd.

source: Send feedback
cy: Anfon adborth

source: The testing phase for this service has now finished
cy: Mae'r cyfnod profi ar gyfer y gwasanaeth hwn bellach wedi gorffen

source: You can check if you may be eligible for support from the Great British Insulation Scheme when the service launches in the coming weeks.
cy: Gallwch wirio a allech chi fod yn gymwys i gael cymorth gan Gynllun Inswleiddio Mawr Prydain pan fydd y gwasanaeth yn cael ei lansio yn yr wythnosau nesaf.

source: Find out more about
cy: Rhagor o wybodaeth am

source: the Great British Insulation Scheme (opens in a new tab)
cy: Cynllun Inswleiddio Mawr Prydain (yn agor mewn tab newydd)

source: Access more household energy support
cy: Cael rhagor o gymorth ynni cartref

source: You can:
cy: Rydych chi'n gallu:

source: get:
cy: cael:

source: help with your energy bills from the Help for Households service (opens in a new tab)
cy: help gyda'ch biliau ynni gan y gwasanaeth Cymorth i Aelwydydd (yn agor mewn tab newydd)

source: visit:
cy: edrych ar:

source: access household energy-saving tips from the Energy Savings Trust (opens in a new tab)
cy: awgrymiadau arbed ynni yn y cartref gan yr Ymddiriedolaeth Arbed Ynni (yn agor mewn tab newydd)

source: household energy-saving tips from Citizen’s Advice (opens in a new tab)
cy: awgrymiadau arbed ynni yn y cartref gan Gyngor ar Bopeth (yn agor mewn tab newydd)

source: Homepage - Check eligibility for Great British Insulation Scheme - GOV.UK
cy: Hafan - Gwirio’ch cymhwystra ar gyfer Cynllun Inswleiddio Mawr Prydain - GOV.UK

source: Check if you may be eligible for the Great British Insulation Scheme
cy: Gwirio'ch Cymhwystra ar gyfer Cynllun Inswleiddio Mawr Prydain

source: cavity wall insulation
cy: inswleiddiad waliau ceudod

source: solid wall insulation (internal or external)
cy: inswleiddiad waliau solet (mewnol neu allanol)

source: loft insulation
cy: inswleiddiad atig

source: flat or pitched roof insulation
cy: inswleiddiad to fflat neu do ar oleddf

source: underfloor insulation
cy: inswleiddiad dan y llawr

source: solid floor insulation
cy: inswleiddiad llawr solet

source: park home insulation
cy: inswleiddiad cartref mewn parc

source: room-in-roof insulation
cy: wleiddiad ystafell yn y to

source: What is your household income? - Check eligibility for Great British Insulation Scheme - GOV.UK
cy: Beth yw incwm eich aelwyd? - Gwirio’ch cymhwystra ar gyfer Cynllun Inswleiddio Mawr Prydain - GOV.UK

source: What is your annual household income?
cy: Beth yw incwm blynyddol eich aelwyd?

source: Your annual household income is the total income before paying tax for all adults living in your home.
cy: Incwm blynyddol eich aelwyd yw cyfanswm yr incwm cyn talu treth ar gyfer pob oedolyn sy'n byw ar eich aelwyd.

source: Why we need this info
cy: Pam mae arnon ni angen yr wybodaeth yma

source: Your annual household income is used to work out how much support you can get through each scheme.
cy: Mae incwm blynyddol eich aelwyd yn cael ei ddefnyddio i gyfrifo faint o gymorth y gallwch ei gael drwy bob cynllun.

source: Your property is not eligible
cy: Dyw eich eiddo chi ddim yn gymwys

source: Based on your answers, your property is not eligible to access energy-saving measures.
cy: Ar sail eich atebion, nid yw'ch eiddo yn gymwys i gael mesurau arbed ynni.

source: Do you have access to the loft? - Check eligibility for Great British Insulation Scheme - GOV.UK
cy: Oes modd mynd i'ch atig? - Gwirio’ch cymhwystra ar gyfer Cynllun Inswleiddio Mawr Prydain - GOV.UK

source: You may have a loft hatch, access ladder or stairs that could allow an insulation installer to get into the loft space.
cy: Efallai bod gennych chi agoriad i'r atig, ysgol neu risiau a allai ganiatáu i osodwr inswleiddiad fynd i mewn i'r lle yn yr atig.

source: Homes of your type typically
cy: Fel arfer mae gan aelwydydd o'ch math chi

source: have access to their loft
cy: fynediad i'r atig

source: Does your loft have insulation? - Check eligibility for Great British Insulation Scheme - GOV.UK
cy: Oes gan eich atig insiwleiddiad? - Gwirio’ch cymhwystra ar gyfer Cynllun Inswleiddio Mawr Prydain - GOV.UK

source: How much loft insulation do you have?
cy: Faint o inswleiddiad atig sydd gennych chi?

source: A loft is fully insulated if it has 270mm (about 10-11 inches) of insulation covering the whole loft, usually laid on the 'floor' of the loft with one layer between the horizontal timber joists and another layer going across them to bring the insulation up to the required level.
cy: Mae atig wedi'i inswleiddio'n llawn os oes ganddo fwy na 270mm (tua 10-11 modfedd) o inswleiddiad sy'n gorchuddio'r atig cyfan, fel arfer wedi'i osod ar 'lawr' yr atig gydag un haen rhwng y coed llorweddol a haen arall yn mynd ar eu traws i godi'r deunydd inswleiddio i'r lefel ofynnol.

source: A loft with less than 100mm of insulation could benefit from additional insulation.
cy: Byddai atig â llai na 100mm o inswleiddiad ar ei ennill pe bai’n cael rhagor o inswleiddiad.

source: Help me answer this question
cy: Helpwch fi i ateb y cwestiwn yma

source: If your home was built after 2002, or you have installed loft insulation since 2002, it is likely that it is fully insulated.
cy: Os cafodd eich aelwyd ei adeiladu ar ôl 2002, neu os ydych chi wedi gosod inswleiddiad yn yr atig ers 2002, mae'n debygol ei fod wedi'i inswleiddio'n llawn.

source: If you have insulation above the level of the joist it is likely to be more than 100mm thick already.
cy: Os oes gennych chi inswleiddiad uwchben lefel y distiau mae’n debygol o fod yn fwy na 100mm o drwch yn barod.

source: Is there a loft? - Check eligibility for Great British Insulation Scheme - GOV.UK
cy: Oes yna atig? - Gwirio’ch cymhwystra ar gyfer Cynllun Inswleiddio Mawr Prydain - GOV.UK

source: Do you have a loft that has not been converted into a room?
cy: Oes gennych chi atig sydd heb ei droi'n ystafell?

source: Help me decide if I have a loft
cy: Helpwch fi i benderfynu a oes gen i atig

source: A loft is an unheated space without walls and ceilings, immediately beneath the pitched roof. You will usually be able to see the roof timbers.
cy: Mae atig yn fan sydd heb ei chynhesu ac sydd heb waliau a nenfwd, yn union o dan y to crib. Fel arfer byddwch yn gallu gweld coed y to.

source: If all the space under your pitched roof, or nearly all the space, is used as living space with finished walls and ceilings then the loft has been converted into a room.
cy: Os yw'r cyfan o'r lle o dan grib y to, neu bron y cyfan o'r lle, yn cael ei ddefnyddio fel lle byw gyda waliau a nenfydau gorffenedig, yna mae'r atig wedi'i droi'n ystafell.

source: Northern Ireland - Check eligibility for Great British Insulation Scheme - GOV.UK
cy: Gogledd Iwerddon - Gwirio’ch cymhwystra ar gyfer Cynllun Inswleiddio Mawr Prydain - GOV.UK

source: This service is not available for homes in Northern Ireland
cy: Nid yw'r gwasanaeth yma ar gael i aelwydydd yng Ngogledd Iwerddon

source: The energy efficiency support available through this scheme is available to homes in England, Wales and Scotland. For advice on energy support measures in Northern Ireland visit the
cy: Mae'r cymorth effeithlonrwydd ynni sydd ar gael drwy'r cynllun yma ar gael i aelwydydd yng Nghymru, Lloegr a'r Alban. I gael cyngor ar fesurau cymorth ynni yng Ngogledd Iwerddon, ewch i

source: NI Direct government services website
cy: wefan gwasanaethau llywodraeth NI Direct

source: Page not found - Check eligibility for Great British Insulation Scheme - GOV.UK
cy: Heb ganfod y dudalen - Gwirio’ch cymhwystra ar gyfer Cynllun Inswleiddio Mawr Prydain - GOV.UK

source: Page not found
cy: Heb ganfod y dudalen

source: If you typed the web address, check it is correct.
cy: Os oeddech chi wedi teipio’r cyfeiriad gwe, gwnewch yn siŵr ei fod yn gywir.

source: How many bedrooms does your property have? - Check eligibility for Great British Insulation Scheme - GOV.UK
cy: Faint o ystafelloedd gwely sydd gan eich eiddo? - Gwirio’ch cymhwystra ar gyfer Cynllun Inswleiddio Mawr Prydain - GOV.UK

source: How many bedrooms does the property have?
cy: Faint o ystafelloedd gwely sydd gan yr eiddo?

source: Select the total number of bedrooms the property has. Include all bedrooms even if you use them for something else, like a home office.
cy: Dewiswch nifer yr ystafelloedd gwely sydd gan yr eiddo. Dylech gynnwys pob ystafell wely hyd yn oed os ydych chi'n eu defnyddio ar gyfer rhywbeth arall, fel swyddfa gartref.

source: Do you own your own property? - Check eligibility for Great British Insulation Scheme - GOV.UK
cy: Ydych chi'n berchen ar eich eiddo eich hun? - Gwirio’ch cymhwystra ar gyfer Cynllun Inswleiddio Mawr Prydain - GOV.UK

source: Do you own the property?
cy: Ydy'r eiddo'n perthyn i chi?

source: Your property is not eligible - Check eligibility for Great British Insulation Scheme - GOV.UK
cy: Dyw eich eiddo chi ddim yn gymwys - Gwirio'ch cymhwystra ar gyfer Cynllun Inswleiddio Mawr Prydain - GOV.UK

source: Based on your answers, your property is not eligible to access energy-saving measures because it is not your main residence.
cy: Ar sail eich atebion, dyw eich aelwyd mewn parc ddim yn gymwys i gael mesurau arbed ynni a hynny am nad dyma'ch prif breswylfa.

source: Is the park home your main residence? - Check eligibility for Great British Insulation Scheme - GOV.UK
cy: Ai'r aelwyd mewn parc yw'ch prif breswylfa? - Gwirio’ch cymhwystra ar gyfer Cynllun Inswleiddio Mawr Prydain - GOV.UK

source: Select no if you use your park home for only part of the year such as only during the summer.
cy: Dewiswch 'nage' os ydych chi'n defnyddio'ch aelwyd mewn parc am ran o'r flwyddyn yn unig, megis yn ystod yr haf yn unig.

source: Do you live in a park home? - Check eligibility for Great British Insulation Scheme - GOV.UK
cy: Ydych chi'n byw mewn aelwyd mewn parc? - Gwirio’ch cymhwystra ar gyfer Cynllun Inswleiddio Mawr Prydain - GOV.UK

source: Privacy policy - Check eligibility for Great British Insulation Scheme - GOV.UK
cy: Polisi preifatrwydd - Gwirio’ch cymhwystra ar gyfer Cynllun Inswleiddio Mawr Prydain - GOV.UK

source: Privacy Notice – the Great British Insulation Scheme
cy: Hysbysiad Preifatrwydd – Cynllun Inswleiddio Mawr Prydain

source: This notice is provided to meet the requirements of the UK General Data Protection Regulation (UK GDPR) and Data Protection Act 2018 (DPA) to provide transparency in how we process and use personal data collected for the GOV.UK referral service for the Great British Insulation Scheme (GB Insulation Scheme), and your rights. It is made under Articles 13 and 14 of the UK GDPR.
cy: Mae'r hysbysiad yma wedi'i ddarparu i ateb gofynion Rheoliad Cyffredinol y Deyrnas Unedig ar Ddiogelu Data (GDPR y Deyrnas Unedig) a Deddf Diogelu Data 2018 (Deddf 2018) er mwyn bod yn dryloyw o ran sut rydyn ni'n prosesu ac yn defnyddio data personol sy'n cael ei gasglu ar ran gwasanaeth atgyfeirio GOV.UK ar gyfer Cynllun Inswleiddio Mawr Prydain, a'ch hawliau chi. Mae'r hysbysiad wedi'i wneud o dan Erthyglau 13 a 14 o GDPR y Deyrnas Unedig.

source: The Check Eligibility for GB Insulation service allows users to check their eligibility for help with energy efficiency measures through relevant government schemes, specifically the Great British Insulation Scheme. Users will also be advised where additional help through the Energy Company Obligation (ECO4) may be available. If the service gives an indication that the user and their property may be eligible for support, based on information that the user is invited to provide, then they can create a referral that will make their details available to an energy supplier. This will usually be their own energy provider unless the user themselves selects another.
cy: Mae gwasanaeth Gwirio’ch Cymhwystra ar gyfer Cynllun Inswleiddio Mawr Prydain yn galluogi'r defnyddwyr i wirio a ydyn nhw'n gymwys i gael cymorth gyda mesurau effeithlonrwydd ynni trwy gynlluniau perthnasol y llywodraeth, ac yn benodol Cynllun Inswleiddio Mawr Prydain. Bydd y defnyddwyr hefyd yn cael eu hysbysu lle gall cymorth ychwanegol fod ar gael drwy'r Rhwymedigaeth Cwmni Ynni (ECO4). Os yw'r gwasanaeth yn rhoi arwydd y gallai'r defnyddiwr a'i eiddo fod yn gymwys i gael cymorth, ar sail yr wybodaeth y gwahoddir y defnyddiwr i'w darparu, yna gall y gwasanaeth greu atgyfeiriad a fydd yn sicrhau bod eu manylion ar gael i gyflenwr ynni. Fel arfer eu darparwr ynni eu hunain fydd hwn oni bai bod y defnyddiwr ei hun yn dewis un arall.

source: This privacy notice relates to how your data is used in connection with the service and covers information saved as you proceed through the application and after you submit your application.
cy: Mae'r hysbysiad preifatrwydd yma yn ymwneud â sut mae'ch data'n cael ei ddefnyddio mewn cysylltiad â'r gwasanaeth ac mae'n cynnwys gwybodaeth a gadwyd wrth ichi fynd ymlaen â'r cais ac ar ôl ichi gyflwyno'ch cais.
