Repository: UKGovernmentBEIS/help-to-heat-GBIS
Catalog: help_to_heat/locale/*/LC_MESSAGES/django.po
Languages: cy

source: Country of property
cy: Gwlad yr eiddo

source: Energy supplier
cy: Cyflenwr ynni

# summary page
source: Do you own the property?
cy: Ydy'r eiddo yn perthyn i chi?

source: Do you live in a park home?
cy: Ydych chi'n byw mewn aelwyd mewn parc?

source: Is the park home your main residence?
cy: Ai'r aelwyd mewn parc yw'ch prif breswylfa?

source: Property address
cy: Cyfeiriad yr eiddo

source: Council tax band
cy: Band treth gyngor

source: Energy Performance Certificate
cy: Dystysgrif Perfformiad Ynni

source: Is anyone in your household receiving any of the following benefits?
cy: Oes unrhyw un yn eich aelwyd chi'n cael unrhyw un o'r budd-daliadau canlynol?

source: Annual household income
cy: Incwm blynyddol yr aelwyd

source: Property type
cy: Math o eiddo

source: Number of bedrooms
cy: Nifer yr ystafelloedd gwely

source: Property walls
cy: Waliau'r eiddo

# summary page
source: Are your walls insulated?
cy: Ydy'ch waliau wedi'u hinswleiddio?

source: Does this property have a loft?
cy: Oes gan yr eiddo yma atig?

source: Is there access to your loft?
cy: Oes modd mynd i'ch atig?

source: Is there 100mm of insulation in your loft?
cy: Oes 100mm o inswleiddiad yn eich atig?

source: First name
cy: Enw cyntaf

source: Last name
cy: Enw olaf

source: Contact number
cy: Rhif ffôn

source: Email
cy: Ebost

source: England
cy: Lloegr

source: Scotland
cy: Yr Alban

source: Wales
cy: Cymru

source: Northern Ireland
cy: Gogledd Iwerddon

source: Yes, I own my property and live in it
cy: Ydy, mae'r eiddo'n perthyn i mi a dwi'n byw ynddo

source: No, I am a tenant
cy: Nac ydy. Tenant ydw i

source: If you are eligible for a referral through this service, your energy supplier will need to check that you have your landlord’s permission to install any energy-saving measures to the property.
cy: Os ydych chi'n gymwys i gael atgyfeiriad drwy'r gwasanaeth hwn, bydd angen i'ch cyflenwr ynni wirio bod gennych chi ganiatâd eich landlord i osod unrhyw fesurau arbed ynni yn yr eiddo.

source: No, I am a social housing tenant
cy: Nac ydy. Dwi'n denant tai cymdeithasol

source: Yes, I am the property owner but I lease the property to one or more tenants
cy: Ydy, mae'r eiddo'n perthyn i mi ond dwi'n gosod yr eiddo i un neu ragor o denantiaid

# park home question option
source: Yes
cy: Ydw

# park home question option
source: No
cy: Nad ydw

source: Yes
cy: Ie

source: No
cy: Nage

source: I do not know
cy: Wn i ddim

source: Not found
cy: Heb ei ganfod

# yes no question option
source: Yes
cy: Oes

# yes no question option
source: No
cy: Nac oes

source: Less than £31,000 a year
cy: Llai na £31,000 y flwyddyn

source: £31,000 or more a year
cy: £31,000 y flwyddyn neu ragor

source: House
cy: Tŷ

source: Bungalow
cy: Byngalo

source: Apartment, flat or maisonette
cy: Rhandy, fflat neu fflat ddeulawr

source: house
cy: dŷ

source: bungalow
cy: fyngalo

source: apartment, flat or maisonette
cy: randy, fflat neu fflat ddeulawr

source: Detached
cy: Tŷ sengl

source: Semi-detached
cy: Tŷ pâr

source: Terraced
cy: Tŷ teras

source: End terrace
cy: Tŷ pen teras

source: Top floor
cy: Llawr uchaf

source: Middle floor
cy: Llawr canol

source: Ground floor
cy: Llawr daear

source: Studio
cy: Stiwdio

source: One bedroom
cy: Un ystafell wely

source: Two bedrooms
cy: Dwy ystafell wely

source: Three or more bedrooms
cy: Tair neu fwy o ystafelloedd gwely

source: Solid walls
cy: Waliau solet

source: Cavity walls
cy: Waliau ceudod

source: Mix of solid and cavity walls
cy: Cymysgedd o waliau solet a waliau ceudod

source: I do not see my option listed
cy: Dwi ddim yn gweld bod fy opsiwn i wedi'i restru

source: Yes they are all insulated
cy: Ydyn, maen nhw i gyd wedi'u hinswleiddio

source: Some are insulated, some are not
cy: Mae rhai wedi'u eu hinswleiddio, mae rhai heb

source: No they are not insulated
cy: Na, dydyn nhw ddim wedi'u hinswleiddio

source: Yes, I have a loft that has not been converted into a room
cy: Oes, mae gen i atig sydd heb ei droi'n ystafell

source: No, I do not have a loft or my loft has been converted into a room
cy: Nac oes, does gen i ddim atig neu mae fy atig i wedi'i droi'n ystafell

source: Yes, there is access to my loft
cy: Oes, mae modd mynd i'r atig

source: No, there is no access to my loft
cy: Nac oes, does dim modd mynd i'r atig

source: No loft
cy: Dim atig

source: I have more than 100mm of loft insulation
cy: Mae gen i fwy na 100mm o inswleiddiad atig

source: I have up to 100mm of loft insulation
cy: Mae gen i hyd at 100mm o inswleiddiad atig

source: Sits directly below the roof with no other flat above it
cy: Yn gorwedd yn union o dan y to heb unrhyw fflat arall uwch ei phen

source: Has another flat above, and another below
cy: Mae fflat arall uwchben, ac un arall odani

source: The lowest flat in the building with no flat beneath - typically at street level but may be a basement
cy: Y fflat isaf yn yr adeilad heb fflat odani - fel arfer ar lefel y stryd ond gall fod yn islawr

source: Does not share any of its walls with another house or building
cy: Nid yw'n rhannu unrhyw un o'i waliau â thŷ neu adeilad arall

source: Is attached to one other house or building
cy: Mae wedi'i gysylltu ag un tŷ neu adeilad arall

source: Sits in the middle with a house or building on each side
cy: Yn sefyll yn y canol gyda thŷ neu adeilad o boptu iddo

source: Sits at the end of a row of similar houses with one house attached to it
cy: Yn sefyll ar ben rhes o dai tebyg gydag un tŷ ynghlwm wrtho

source: Other wall types could include cob walls, timber framed, system built, steel framed or other non-traditional build types
cy: Gallai mathau eraill o waliau gynnwys waliau cob, waliau ffrâm pren, adeiladu system, fframiau dur neu fathau eraill o adeiladau anhraddodiadol

source: Bulb, now part of Octopus Energy
cy: Bulb, sydd bellach yn rhan o Octopus

source: Completely agree
cy: Cytuno'n llwyr

source: Agree
cy: Cytuno

source: Neutral
cy: Niwtral

source: Disagree
cy: Anghytuno

source: Completely disagree
cy: Anghytuno'n llwyr

source: Very satisfied
cy: Bodlon iawn

source: Somewhat satisfied
cy: Eithaf bodlon

source: Neither satisfied nor dissatisfied
cy: Ddim yn fodlon nac yn anfodlon

source: Somewhat dissatisfied
cy: Eithaf anfodlon

source: Very dissatisfied
cy: Anfodlon iawn

source: To find ways to reduce my energy bills
cy: Dod o hyd i ffyrdd i leihau fy miliau ynni

source: To find ways to reduce my carbon emissions
cy: Dod o hyd i ffyrdd i leihau fy allyriadau carbon

source: To find ways to install a specific measure in my home
cy: Dod o hyd i ffyrdd o osod mesur penodol yn fy nghartref

source: To find ways to improve my EPC rating
cy: Dod o hyd i ffyrdd i wella fy sgôr EPC

source: To find ways to make my home more comfortable
cy: Dod o hyd i ffyrdd i wneud fy nghartref yn fwy cyffyrddus

source: Other
cy: Arall

source: Please enter a valid UK postcode
cy: Rhowch god post dilys yn y Deyrnas Unedig

source: Invalid email format
cy: Fformat ebost annilys

source: Enter a telephone number, like 01632 960 001, 07700 900 982 or +44 808 157 0192
cy: Rhowch rif ffôn, fel 01632 960 001, 07700 900 982 neu +44 808 157 0192

source: Energy Company Obligation 4
cy: Rhwymedigaeth Cwmni Ynni 4

source: Great British Insulation Scheme
cy: Cynllun Inswleiddio Mawr Prydain

source: Select where the property is located
cy: Dewiswch beth yw lleoliad yr eiddo

source: Select if you own the property
cy: Dewiswch os yw'r eiddo'n perthyn i chi

source: Select if you live in a park home
cy: Dewiswch os ydych chi’n byw mewn aelwyd mewn parc

source: Select if the park home is your main residence
cy: Dewiswch os eich aelwyd mewn parc yw’ch prif breswylfa

source: Enter building name or number
cy: Rhowch enw neu rif yr adeilad

source: Enter Address line 1
cy: Rhowch linell 1 y cyfeiriad

source: Enter a postcode
cy: Rhowch god post

source: Select your address
cy: Dewiswch eich cyfeiriad

source: Enter your Town or city
cy: Rhowch eich tref neu'ch dinas

source: Enter the Council Tax Band of the property
cy: Rhowch Fand Treth Gyngor yr eiddo

source: Select if your EPC rating is correct or not, or that you do not know
cy: Dewiswch a yw eich cyfraddiad EPC yn gywir neu beidio, neu nad ydych chi'n gwybod

source: Select if anyone in your household is receiving any benefits listed below
cy: Dewiswch a oes unrhyw un yn eich aelwyd chi'n cael unrhyw un neu ragor o'r budd-daliadau isod

source: Select your household income
cy: Dewiswch incwm eich aelwyd

source: Select your property type
cy: Dewiswch eich math o eiddo

source: Select the number of bedrooms the property has
cy: Dewiswch nifer yr ystafelloedd gwely sydd gan yr eiddo

source: Select the type of walls the property has
cy: Dewiswch y math o waliau sydd gan yr eiddo

source: Select if the walls of the property are insulated or not, or if you do not know
cy: Dewiswch a ydy waliau'r eiddo wedi'u hinswleiddio neu beidio, neu nad ydych chi'n gwybod

source: Select if you have a loft that has been converted into a room or not
cy: Dewiswch a oes gennych chi atig sydd wedi'i droi'n ystafell neu beidio

source: Select whether or not you have access to the loft
cy: Dewiswch a oes modd mynd i'r atig neu beidio

source: Select whether or not your loft is fully insulated
cy: Dewiswch a ydy'ch atig wedi'i inswleiddio'n llawn neu beidio

source: Select your home energy supplier from the list below
cy: Dewiswch eich cyflenwr ynni cartref chi o blith y rhestr isod

source: Enter your first name
cy: Rhowch eich enw cyntaf

source: Enter your last name
cy: Rhowch eich enw olaf

source: Enter your email address
cy: Rhowch eich cyfeiriad ebost

source: Enter your contact number
cy: Rhowch eich rhif ffôn

source: Please confirm that you agree to the use of your information by checking this box
cy: Rhowch gadarnhad eich bod yn cytuno i'ch gwybodaeth gael ei defnyddio drwy roi tic yn y blwch hwn

source: Please confirm that you understand your home must be sufficiently ventilated before any insulation is installed
cy: Rhowch gadarnhad eich bod yn deall bod rhaid bod i’ch cartref fod wedi’i awyru’n ddigonol cyn i unrhyw inswleiddiad gael ei osod

source: Please confirm that you understand you may be required to contribute towards the cost of installing insulation
cy: Rhowch gadarnhad eich bod yn deall y gall fod angen ichi gyfrannu at gost gosod inswleiddiad

source: ©Crown copyright
cy: ©Hawlfraint y Goron

source: Password has been reset
cy: Mae'r cyfrinair wedi'i ailosod

source: Back
cy: Yn ôl

source: Your password has successfully been reset. You can now return to the log in page.
cy: Mae eich cyfrinair wedi'i ailosod yn llwyddiannus. Nawr gallwch fynd yn ôl i fewngofnodi.

source: Log in
cy: Mewngofnodi

source: View accessibility statement - Check eligibility for Great British Insulation Scheme - GOV.UK
cy: Gweld datganiad hygyrchedd - Gwirio’ch cymhwystra ar gyfer Cynllun Inswleiddio Mawr Prydain - GOV.UK

source: Accessibility Statement
cy: Datganiad Hygyrchedd

source: This accessibility statement applies to Great British Insulation Scheme.
cy: Mae'r datganiad hygyrchedd yma yn gymwys i Gynllun Inswleiddio Mawr Prydain.

source: This website is run by Department for Energy Security and Net Zero (DESNZ). We want as many people as possible to be able to use this website. For example, that means you should be able to:
cy: Mae'r wefan yma'n cael ei rhedeg gan yr Adran Diogelwch Ynni a Sero Net (DESNZ). Rydyn ni am i gynifer o bobl â phosibl allu defnyddio'r wefan yma. Er enghraifft, mae hyn yn golygu y dylech chi allu:

source: change colours, contrast levels and fonts
cy: newid lliwiau, lefelau cyferbyniad a ffontiau

source: zoom in up to 300% without the text spilling off the screen
cy: chwyddo i mewn hyd at 300% heb i'r testun ollwng oddi ar y sgrin

source: navigate most of the website using just a keyboard
cy: llywio'r rhan fwyaf o'r wefan drwy ddefnyddio'r bysellfwrdd yn unig

source: navigate most of the website using speech recognition software
cy: llywio'r rhan fwyaf o'r wefan drwy ddefnyddio meddalwedd adnabod lleferydd

source: listen to most of the website using a screen reader (including the most recent versions of JAWS, NVDA and VoiceOver)
cy: gwrando ar y rhan fwyaf o'r wefan drwy ddefnyddio darllenydd sgrin (gan gynnwys y fersiynau diweddaraf o JAWS, NVDA a VoiceOver)

source: We’ve also made the website text as simple as possible to understand.
cy: Rydyn ni hefyd wedi gwneud testun y wefan mor syml â phosibl i'w ddeall.

source: <a class="govuk-link" href="https://mcmw.abilitynet.org.uk/" target="_blank">AbilityNet</a> has advice on making your device easier to use if you have a disability.
cy: Mae gan <a class="govuk-link" href="https://mcmw.abilitynet.org.uk/" target="_blank">AbilityNet</a> gyngor ar wneud eich dyfais yn haws i'w defnyddio os oes gennych anabledd.

source: How accessible this website is
cy: Pa mor hygyrch yw'r wefan yma

source: This website is fully accessible.
cy: Mae'r wefan yma yn gwbl hygyrch.

source: Feedback and contact information
cy: Adborth a gwybodaeth gysylltu

source: If you need information on this website in a different format like accessible PDF, large print, easy read, audio recording or braille:
cy: Os oes arnoch chi angen gwybodaeth ar y wefan hon mewn fformat gwahanol fel PDF hygyrch, print bras, hawdd ei ddarllen, recordiad sain neu braille:

source: call 0800 098 7950
cy: ffoniwch 0800 098 7950

source: We’ll consider your request and get back to you in 10 working days.
cy: byddwn yn ystyried eich cais ac yn cysylltu â chi o fewn 10 diwrnod gwaith.

source: Reporting accessibility problems with this website
cy: Rhoi gwybod am broblemau hygyrchedd gyda'r wefan yma

source: We’re always looking to improve the accessibility of this website. If you find any problems not listed on this page or think we’re not meeting accessibility requirements, contact:
cy: Rydyn ni bob amser yn ceisio gwella hygyrchedd y wefan yma. Os byddwch chi'n gweld unrhyw broblemau sydd heb eu rhestru ar y tudalen yma neu'n credu ein bod ni heb fodloni gofynion hygyrchedd, cysylltwch â:

source: Enforcement procedure
cy: Gweithdrefn orfodi

source: The Equality and Human Rights Commission (EHRC) is responsible for enforcing the Public Sector Bodies (Websites and Mobile Applications) (No. 2) Accessibility Regulations 2018 (the ‘accessibility regulations’). If you’re not happy with how we respond to your complaint,
cy: Mae'r Comisiwn Cydraddoldeb a Hawliau Dynol (EHRC) yn gyfrifol am orfodi Rheoliadau Hygyrchedd Cyrff y Sector Cyhoeddus (Gwefannau a Chymwysiadau Symudol) (Rhif 2) 2018 (y 'rheoliadau hygyrchedd'). Os nad ydych chi'n fodlon ar y ffordd rydyn ni'n ymateb i'ch cwyn,

source: contact the Equality Advisory and Support Service (EASS)
cy: cysylltwch â'r Gwasanaeth Cynghori a Chymorth Cydraddoldeb (EASS)

source: Contacting us by phone or visiting us in person
cy: Cysylltu â ni dros y ffôn neu ymweld â ni'n bersonol

source: We provide a text relay service for people who are D/deaf, hearing impaired or have a speech impediment.
cy: Rydyn ni'n darparu gwasanaeth trosglwyddo testun ar gyfer pobl sy'n fyddar, pobl sydd â nam ar eu clyw neu sydd â nam ar eu lleferydd.

source: Our offices have audio induction loops, or if you contact us before your visit we can arrange a British Sign Language (BSL) interpreter.
cy: Mae gan ein swyddfeydd ddolenni sain, neu os byddwch yn cysylltu â ni cyn eich ymweliad gallwn drefnu dehonglydd Iaith Arwyddion Prydain (BSL).

source: Find out how to contact us
cy: Rhagor o wybodaeth am sut i gysylltu â ni:

source: Technical information about this website’s accessibility
cy: Gwybodaeth dechnegol am hygyrchedd y wefan yma

source: BEIS is committed to making its website accessible, in accordance with the Public Sector Bodies (Websites and Mobile Applications) (No. 2) Accessibility Regulations 2018.
cy: Mae BEIS wedi ymrwymo i wneud ei gwefan yn hygyrch, yn unol â Rheoliadau Hygyrchedd Cyrff y Sector Cyhoeddus (Gwefannau a Chymwysiadau Symudol) (Rhif 2) 2018.

source: Compliance status
cy: Statws cydymffurfio

source: This website is compliant with the
cy: Mae'r wefan yma yn cydymffurfio â

source: Web Content Accessibility Guidelines version 2.1 AA standard
cy: safon AA Canllawiau Hygyrchedd Cynnwys y We fersiwn 2.1

source: Preparation of this accessibility statement
cy: Paratoi'r datganiad hygyrchedd yma

source: This statement was prepared on 19 July 2023. It was last reviewed on 25 July 2023.
cy: Cafodd y datganiad yma ei baratoi ar 19 Gorffennaf 2023. Y tro diwethaf iddo gael ei adolygu oedd 25 Gorffennaf 2023.

source: This website was last tested on 25 July 2023. The test was carried out by Zoonou.
cy: Y tro diwethaf i'r wefan yma gael ei phrofi oedd 25 Gorffennaf 2023. Cafodd y prawf ei gynnal gan Zoonou.

source: Zoonou used
cy: Defnyddiodd Zoonou

source: to define the pages tested and test approach.
cy: i ddiffinio'r tudalennau a gâi eu profi a'r dull profi.

source: Enter the property address manually - Check eligibility for Great British Insulation Scheme - GOV.UK
cy: Rhoi cyfeiriad yr eiddo eich hunan - Gwirio’ch cymhwystra ar gyfer Cynllun Inswleiddio Mawr Prydain - GOV.UK

source: What is the property's address?
cy: Beth yw cyfeiriad yr eiddo?

source: Address line 1
cy: Llinell 1 y cyfeiriad

source: Address line 2 (optional)
cy: Llinell 2 y cyfeiriad (dewisol)

source: Town or city
cy: Tref neu ddinas

source: County (optional)
cy: Sir (dewisol)

source: Postcode
cy: Cod post

source: Select the property address - Check eligibility for Great British Insulation Scheme - GOV.UK
cy: Dewis cyfeiriad yr eiddo - Gwiri cymhwystra ar gyfer Cynllun Inswleiddio Mawr Prydain - GOV.UK

source: No addresses found
cy: Dim cyfeiriadau wedi’u canfod

source: I cannot find my address. I want to enter it manually
cy: Dwi'n methu gweld fy nghyfeiriad i. Hoffwn ei roi fy hunan.

source: What is the property address? - Check eligibility for Great British Insulation Scheme - GOV.UK
cy: Beth yw cyfeiriad yr eiddo? - Gwirio’ch cymhwystra ar gyfer Cynllun Inswleiddio Mawr Prydain - GOV.UK

source: We use this information to search for an Energy Performance Certificate that matches your address.
cy: Rydyn ni’n defnyddio'r wybodaeth yma i chwilio am Dystysgrif Perfformiad Ynni sy'n cyd-fynd â'ch cyfeiriad chi.

source: Building name or number
cy: Enw neu rif yr adeilad

source: Enter address manually
cy: Rhoi’r cyfeiriad eich hunan

source: Applications closed - Check eligibility for Great British Insulation Scheme - GOV.UK
cy: Ceisiadau wedi cau - Gwirio’ch cymhwystra ar gyfer Cynllun Inswleiddio Mawr Prydain - GOV.UK

source: British Gas are not taking referrals right now but they will be shortly
cy: Dyw British Gas ddim yn cymryd atgyfeiriadau ar hyn o bryd ond fe fyddan nhw cyn hir

source: You can check back again soon.
cy: Gallwch ddod yn ôl eto yn fuan.

source: %(supplier)s are not taking referrals just now
cy: Dyw %(supplier)s ddim yn cymryd atgyfeiriadau ar hyn o bryd

source: If you are a home owner in England and Wales,
cy: Os ydych chi'n berchennog cartref yng Nghymru a Lloegr,

source: you can find other ways to save energy using the find ways to save energy service (opens in a new tab)
cy: gallwch ddod o hyd i ffyrdd eraill o arbed ynni drwy ddefnyddio'r gwasanaeth dod o hyd i ffyrdd o arbed ynni (yn agor mewn tab newydd)

source: Great British Insulation Scheme - GOV.UK
cy: Cynllun Inswleiddio Mawr Prydain - GOV.UK

source: Cookies we are using on our service
cy: Cwcis rydyn ni'n eu defnyddio ar ein gwasanaeth

source: We will use necessary cookies when you use this service to help you move around the site.
cy: Byddwn yn defnyddio cwcis angenrheidiol wrth ichi ddefnyddio'r gwasanaeth yma, a hynny i'ch helpu i symud o amgylch y wefan.

source: We will also use analytic cookies using Google Analytics to tell us how you got to our service, the pages you visit, and how long you spent on them. Analytics cookies help us to improve our service. We do not allow Google to use or share the data about how you use this site and the data is stored anonymously.
cy: Byddwn hefyd yn defnyddio cwcis dadansoddeg gan ddefnyddio Google Analytics i ddweud wrthon ni sut daethoch chi i'n gwasanaeth, y tudalennau rydych chi'n ymweld â nhw a faint o amser rydych chi wedi'i dreulio arnyn nhw. Mae cwcis dadansoddeg yn ein helpu i wella'n gwasanaeth. Dydyn ni ddim yn caniatáu i Google ddefnyddio na rhannu'r data am sut rydych chi'n defnyddio'r wefan yma ac mae'r data'n cael ei storio'n ddienw.

source: Accept cookies
cy: Derbyn cwcis

source: Reject cookies
cy: Gwrthod cwcis

source: View cookies we use on this service
cy: Gweld y cwcis rydyn ni'n eu defnyddio ar y gwasanaeth yma

source: Skip to main content
cy: Neidio i'r prif gynnwys

source: Check eligibility for Great British Insulation Scheme
cy: Gwirio'ch Cymhwystra ar gyfer Cynllun Inswleiddio Mawr Prydain

source: This is a new service – your
cy: Gwasanaeth newydd yw hwn – bydd eich

source: feedback (opens in new tab)
cy: adborth (yn agor mewn tab newydd)

source: will help us to improve it.
cy: yn ein helpu i'w wella.

source: Support links
cy: Dolenni cymorth

source: Privacy Policy
cy: Polisi Preifatrwydd

source: All content is available under the
cy: Mae'r cynnwys i gyd ar gael o dan

source: Open Government Licence v3.0
cy: Drwydded Llywodraeth Agored v3.0

source: , except where otherwise stated
cy: , ac eithrio lle nodir fel arall

source: Do you receive benefits? - Check eligibility for Great British Insulation Scheme - GOV.UK
cy: Ydych chi'n cael budd-daliadau? - Gwirio’ch cymhwystra ar gyfer Cynllun Inswleiddio Mawr Prydain - GOV.UK

source: This information is used to determine the level of support you can get. There is energy-saving help for those who receive benefits as well as those who do not.
cy: Mae'r wybodaeth yma'n cael ei defnyddio i bennu lefel y cymorth y gallwch ei gael. Mae yna gymorth arbed ynni i'r rhai sy'n cael budd-daliadau yn ogystal â'r rhai nad ydyn nhw'n eu cael.

source: Select yes if they are receiving any of the following:
cy: Dewiswch 'oes' os ydyn nhw'n cael unrhyw un neu ragor o'r canlynol:

source: Income based Jobseekers Allowance
cy: Lwfans Ceisio Gwaith yn seiliedig ar incwm

source: Income related Employment and Support Allowance
cy: Lwfans Cyflogaeth a Chymorth sy'n gysylltiedig ag Incwm

source: Income Support
cy: Cymorth Incwm

source: Pension Credit Guarantee Credit
cy: Credyd Gwarant Credyd Pensiwn

source: Working Tax Credit
cy: Credyd Treth Gwaith

source: Child Tax Credit
cy: Credyd Treth Plant

source: Universal Credit
cy: Credyd Cynhwysol

source: Housing Benefit
cy: Budd-dal Tai

source: Pension Credit Savings Credit
cy: Credyd Cynilo Credyd Pensiwn

source: Child Benefit
cy: Budd-dal Plant

source: You may be asked to provide evidence of this at a later stage.
cy: Efallai y gofynnir ichi ddarparu tystiolaeth o hyn yn nes ymlaen.

source: Your referral will be sent to Octopus Energy
cy: Bydd eich atgyfeiriad yn cael ei anfon at Octopus Energy

source: Bulb is now owned by Octopus Energy. Your referral will be sent to Octopus Energy to help with your application.
cy: Erbyn hyn, mae Bulb yn perthyn i Octopus Energy. Bydd eich atgyfeiriad yn cael ei anfon at Octopus Energy i helpu gyda'ch cais.

source: Confirm and submit - Check eligibility for Great British Insulation Scheme - GOV.UK
cy: Cadarnhau a chyflwyno - Gwirio’ch cymhwystra ar gyfer Cynllun Inswleiddio Mawr Prydain - GOV.UK

source: Submit
cy: Cyflwyno

source: Confirm and submit
cy: Cadarnhau a chyflwyno
