Repository: UKGovernmentBEIS/help-to-heat-GBIS
Catalog: help_to_heat/locale/*/LC_MESSAGES/django.po
Languages: cy

source: Sorry, the service is unavailable
cy: Ymddiheuriadau, dyw'r gwasanaeth ddim ar gael

source: Shell is now owned by Octopus Energy. Your referral will be sent to Octopus Energy to help with your application.
cy: Erbyn hyn, mae Shell yn perthyn i Octopus Energy. Bydd eich atgyfeiriad yn cael ei anfon at Octopus Energy i helpu gyda'ch cais.

source: Sorry, there is a problem with this service - Check eligibility for Great British Insulation Scheme - GOV.UK
cy: Ymddiheuriadau, mae yna broblem gyda'r gwasanaeth yma - Gwirio’ch cymhwystra ar gyfer Cynllun Inswleiddio Mawr Prydain - GOV.UK

source: Sorry, there is a problem with this service
cy: Ymddiheuriadau, mae yna broblem gyda'r gwasanaeth yma

source: Try again later.
cy: Rhowch gynnig arall arni yn nes ymlaen.

source: You will not be able to apply to the Great British Insulation Scheme until the service is available.
cy: Fyddwch chi ddim yn gallu gwneud cais i Gynllun Inswleiddio Mawr Prydain nes bod y gwasanaeth ar gael.

source: If you already started an application, your answers have not been saved and you will have to start again when the service is available.
cy: Os ydych chi eisoes wedi dechrau cais, dyw'ch atebion ddim wedi cael eu cadw a bydd rhaid ichi ddechrau eto pan fydd y gwasanaeth ar gael.

source: Referral completed - Check eligibility for Great British Insulation Scheme - GOV.UK
cy: Cwblhau atgyfeiriad - Gwirio’ch cymhwystra ar gyfer Cynllun Inswleiddio Mawr Prydain - GOV.UK

source: Your details have been submitted to %(supplier)s
cy: Mae'ch manylion chi wedi'u cyflwyno i %(supplier)s

source: Your reference number is %(referral_id)s
cy: Eich rhif cyfeirnod yw %(referral_id)s

source: If you provided an email address in your referral then we have sent you a confirmation email.
cy: Os rhoesoch chi gyfeiriad ebost yn eich atgyfeiriad, yna rydyn ni wedi anfon neges gadarnhau atoch.

source: You can
cy: Gallwch

source: save or print a copy of your referral
cy: gadw neu argraffu copi o'ch atgyfeiriad

source: What happens next?
cy: Beth sy'n digwydd nesaf?

source: We have sent your referral to the energy supplier you selected. They will contact you within 10 working days to confirm they have received this and about next steps.
cy: Rydyn ni wedi anfon eich cyfeiriad at y cyflenwr ynni a ddewiswyd gennych. Byddan nhw’n cysylltu â chi o fewn 10 diwrnod gwaith i gadarnhau eu bod nhw wedi cael hyn a’r camau nesaf.

source: You do not need to create another referral at any point.
cy: Does dim angen ichi greu atgyfeiriad arall unrhyw bryd.

source: Once the energy supplier has confirmed they have received your referral, they or their delivery partner will review this and determine whether your property could be suitable for energy efficiency improvements. They may ask you for more information. You will then be notified to tell you whether your referral will proceed to the next stage of assessment. If your referral is not progressed, they will let you know why.
cy: Unwaith y bydd y cyflenwr ynni wedi cadarnhau eu bod wedi cael eich atgyfeiriad, fe fyddan nhw neu eu partner cyflenwi yn adolygu'ch atgyfeiriad ac yn penderfynu a allai eich eiddo fod yn addas i gael gwelliannau effeithlonrwydd ynni. Efallai y byddan nhw'n gofyn ichi rhoi rhagor o wybodaeth. Wedyn cewch wybod a fydd eich atgyfeiriad yn symud ymlaen i gyfnod nesaf yr asesiad. Os na fydd eich atgyfeiriad yn symud ymlaen, fe gewch wybod pam.

source: As part of the assessment process, properties must have a home survey completed. Your energy supplier will organise this with you.
cy: Fel rhan o’r broses asesu, rhaid i eiddo gael arolwg cartref wedi'i gwblhau. Bydd eich cyflenwr ynni yn trefnu hyn gyda chi.

source: Contacting the energy supplier about your referral after 10 working days
cy: Cysylltu â'r cyflenwr ynni ynghylch eich atgyfeiriad ar ôl 10 diwrnod gwaith

source: find contact details for the energy supplier (opens in new tab)
cy: ddod o hyd i fanylion cysylltu'r cyflenwr ynni (yn agor mewn tab newydd)

source: if you need to contact them.
cy: os oes angen ichi gysylltu â nhw.

source: You do not need to contact the energy supplier unless it has been more than 10 working days since you submitted the referral and you have not yet received a confirmation email or a phone call from them.
cy: Does dim angen ichi gysylltu â'r cyflenwr ynni oni bai wedi mwy na 10 diwrnod gwaith wedi mynd heibio ers ichi gyflwyno'r atgyfeiriad ac nad ydych wedi cael neges gadarnhau drwy'r ebost neu alwad ffôn ganddyn nhw eto.

source: get
cy: cael

source: visit
cy: edrych ar

source: household energy-saving tips from the Energy Savings Trust (opens in a new tab)
cy: awgrymiadau arbed ynni gartref gan yr Ymddiriedolaeth Arbed Ynni (yn agor mewn tab newydd)

source: household'energy-saving tips from Citizen's Advice (opens in a new tab)
cy: awgrymiadau arbed ynni gartref gan Gyngor ar Bopeth (yn agor mewn tab newydd)

source: Give feedback
cy: Rhoi adborth

source: This service is still in its early stages and under active development.
cy: Mae’n ddyddiau cynnar o hyd ar y gwasanaeth hwn ac mae’n dal i gael ei ddatblygu.

source: Your feedback can help us to shape how the service develops so that it can best serve the needs of the public.
cy: Gall eich adborth ein helpu i ddatblygu’r gwasanaeth er mwyn diwallu anghenion y cyhoedd yn y ffordd orau.

source: Leave some feedback for this service
cy: Gadael adborth ar gyfer y gwasanaeth hwn

source: A summary of your answers - Check eligibility for Great British Insulation Scheme - GOV.UK
cy: Crynodeb o'ch atebion - Gwirio’ch cymhwystra ar gyfer Cynllun Inswleiddio Mawr Prydain - GOV.UK

source: Check your answers
cy: Gwiriwch eich atebion

source: Choose your supplier - Check eligibility for Great British Insulation Scheme - GOV.UK
cy: Dewis eich cyflenwr - Gwirio’ch cymhwystra ar gyfer Cynllun Inswleiddio Mawr Prydain - GOV.UK

source: If your energy supplier contacts you saying they are unable to fulfill the requirements for your home, you can create another referral to a different energy supplier.
cy: Os bydd eich cyflenwr ynni cartref yn cysylltu â chi i ddweud nad ydyn nhw’n gallu cyflawni’r gofynion ar gyfer eich cartref chi, cewch greu atgyfeiriad arall at gyflenwr ynni gwahanol.

source: If your home energy supplier is not listed, you can select any energy supplier from the list.
cy: Os nad yw'ch cyflenwr ynni cartref chi wedi'i restru, cewch ddewis unrhyw gyflenwr ynni o'r rhestr.

source: If you live in a park home and buy your energy from the site, select the energy supplier who supplies the site.
cy: Os ydych chi'n byw mewn aelwyd mewn parc ac yn prynu'ch ynni o'r safle, dewiswch y cyflenwr ynni sy'n cyflenwi'r safle.

source: Your referral will be sent to E.ON Next
cy: welsh

source: Referral requests from UW customers will be managed by E.ON Next
cy: Bydd ceisiadau am atgyfeiriad gan gwsmeriaid UW yn cael eu rheoli gan E.ON Next

source: If, after using this service, you are eligible for the Great British Insulation Scheme and you choose to create a referral, your referral will be sent to E.ON Next, who are accepting referrals and delivering the Great British Insulation Scheme on behalf of Utility Warehouse.
cy: Os ydych chi, ar ôl defnyddio'r gwasanaeth hwn, yn gymwys ar gyfer Cynllun Inswleiddio Mawr Prydain a'ch bod yn dewis creu atgyfeiriad, bydd eich atgyfeiriad yn cael ei anfon at E.ON Next, sy'n derbyn atgyfeiriadau ac yn darparu Cynllun Inswleiddio Mawr Prydain ar ran Utility Warehouse.

source: Do your walls have insulation? - Check eligibility for Great British Insulation Scheme - GOV.UK
cy: Oes gan eich waliau inswleiddiad? - Gwirio’ch cymhwystra ar gyfer Cynllun Inswleiddio Mawr Prydain - GOV.UK

source: Are your walls insulated?
cy: Ydy'ch waliau chi wedi'u hinswleiddio?

source: Cavity walls built before 1991 are typically uninsulated, unless you or someone before you had insulation installed.
cy: At ei gilydd, dyw waliau ceudod a adeiladwyd cyn 1991 ddim wedi'u hinswleiddio, oni bai eich bod chi neu rywun cyn chi wedi trefnu i insiwleiddiad gael ei osod.

source: Cavity walls built after 1991 were typically built with insulating material between the outer and inner walls.
cy: Fel arfer, cafodd waliau ceudod a adeiladwyd ar ôl 1991 eu hadeiladu â deunydd inswleiddio rhwng y waliau allanol a mewnol.

source: Homes built after 1991 were typically built with insulating material between the outer and inner walls.
cy: Fel arfer, roedd cartrefi ar ôl 1991 yn cael eu hadeiladu gyda deunydd inswleiddio rhwng y waliau allanol a mewnol.

source: If your home was converted, for example it was a shop or other commercial premises before, it may have been built without insulation.
cy: Os cafodd eich cartref ei drosi, er enghraifft os oedd yn arfer bod yn siop neu safle masnachol arall o'r blaen, efallai ei fod wedi'i godi heb ei inswleiddio.

source: What type of walls does your property have? - Check eligibility for Great British Insulation Scheme - GOV.UK
cy: Pa fath o waliau sydd gan eich eiddo? - Gwirio’ch cymhwystra ar gyfer Cynllun Inswleiddio Mawr Prydain - GOV.UK

source: What kind of walls does your property have?
cy: Pa fath o waliau sydd gan eich eiddo?

source: Solid walls may be made from brick or stone. If your home was built before 1930, it's likely to have solid walls.
cy: Gall waliau solet fod wedi'u gwneud o frics neu gerrig. Os cafodd eich aelwyd ei godi cyn 1930, mae'n debygol mai waliau solet sydd ganddo.

source: Most homes built after 1930 have cavity walls. Cavity walls have a gap, or cavity, between the wall outside and wall inside.
cy: Mae gan y rhan fwyaf o aelwydydd a adeiladwyd ar ôl 1930 waliau ceudod. Mae gan waliau ceudod fwlch, neu geudod, rhwng y wal y tu allan a'r wal y tu mewn.

source: You may have both types. For example, you have a pre-1930 home with an extension built later than 1930.
cy: Efallai bod gennych chi'r ddau fath, er enghraifft, bod gennych chi gartref cyn 1930 gydag estyniad a gafodd ei godi yn hwyrach na 1930.

source: Help me choose which wall type I have
cy: Helpwch fi i ddewis pa fath o wal sydd gen i

source: Solid brick walls will have an alternating pattern, with some bricks laid across the wall so you can see the smaller ends from the outside.
cy: Bydd gan waliau brics solet batrwm bob yn ail, gyda rhai brics wedi'u gosod ar draws y wal fel y gallwch weld y pennau llai o'r tu allan.

source: If your home has cavity walls, the bricks typically have an even pattern with all bricks laid lengthways.
cy: Os oes gan eich aelwyd waliau ceudod, fel arfer mae gan y brics batrwm cyson gyda'r holl frics wedi'u gosod ar eu hyd.

source: If the brickwork has been covered, you may be able to tell by measuring the width of the wall. Measure the depth of the wall by a window or door on one of your external walls.
cy: Os yw'r gwaith brics wedi'i orchuddio, efallai y byddwch yn gallu dweud trwy fesur lled y wal. Mesurwch ddyfnder y wal wrth ffenestr neu ddrws ar un o'ch waliau allanol.

source: If a brick wall is more than 260mm thick, then it is probably a cavity wall.
cy: Os yw wal frics yn fwy na 260mm o drwch, yna mae'n debyg mai wal ceudod yw hi.

source: A narrower wall is probably a solid wall. Stone walls may be thicker still but are usually solid.
cy: Mae'n debygol bod wal gulach yn wal solet. Gall waliau cerrig fod yn fwy trwchus o hyd ond fel arfer maen nhw'n solet.

source: Continue
cy: Parhau

source: Change
cy: Newid

source: Find other support
cy: Dod o hyd i gymorth arall

source: Check out what other help you can get with your energy bills from the government's
cy: Edrychwch i weld pa help arall y gallwch ei gael gyda'ch biliau ynni drwy gynllun y llywodraeth,

source: Help for Households
cy: Cymorth i Aelwydydd

source: Find out if you can get support from your local council from the
cy: Darganfyddwch a allwch chi gael cymorth gan eich cyngor lleol drwy'r

source: Household Support Fund
cy: Gronfa Cymorth i Aelwydydd
